## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_cdn_frontdoor_custom_domain.matthewjwhite-co-uk will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "matthewjwhite-co-uk" {
      + cdn_frontdoor_profile_id = "/subscriptions/5cf6e0c5-f8d8-4116-9a5e-0554e50f5a45/resourceGroups/rg-uks-webservers/providers/Microsoft.Cdn/profiles/afd-whitefam"
      + expiration_date          = (known after apply)
      + host_name                = "matthewjwhite.co.uk"
      + id                       = (known after apply)
      + name                     = "afd-cd-matthewjwhite-co-uk"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # azurerm_cdn_frontdoor_custom_domain_association.matthewjwhite-co-uk will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "matthewjwhite-co-uk" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # azurerm_cdn_frontdoor_route.matthewjwhite-co-uk will be created
  + resource "azurerm_cdn_frontdoor_route" "matthewjwhite-co-uk" {
      + cdn_frontdoor_custom_domain_ids = (known after apply)
      + cdn_frontdoor_endpoint_id       = "/subscriptions/5cf6e0c5-f8d8-4116-9a5e-0554e50f5a45/resourceGroups/rg-uks-webservers/providers/Microsoft.Cdn/profiles/afd-whitefam/afdEndpoints/afd-ep-matthewjwhite-co-uk"
      + cdn_frontdoor_origin_group_id   = "/subscriptions/5cf6e0c5-f8d8-4116-9a5e-0554e50f5a45/resourceGroups/rg-uks-webservers/providers/Microsoft.Cdn/profiles/afd-whitefam/originGroups/afd-og-matthewjwhite-co-uk"
      + cdn_frontdoor_origin_ids        = [
          + "/subscriptions/5cf6e0c5-f8d8-4116-9a5e-0554e50f5a45/resourceGroups/rg-uks-webservers/providers/Microsoft.Cdn/profiles/afd-whitefam/originGroups/afd-og-matthewjwhite-co-uk/origins/afd-o-matthewjwhite-co-uk",
        ]
      + enabled                         = true
      + forwarding_protocol             = "HttpsOnly"
      + https_redirect_enabled          = true
      + id                              = (known after apply)
      + link_to_default_domain          = false
      + name                            = "afd-rt-matthewjwhite-co-uk"
      + patterns_to_match               = [
          + "/*",
        ]
      + supported_protocols             = [
          + "Http",
          + "Https",
        ]
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + mjw-dnsauth          = (sensitive value)
```
</details>